[Survived] BlockStatement
src/Router.js:34:35
                     <Route path="/my-component" Component={MyComponent}/>
                     <Route path="/test/:id/:name?" Component=
                         {
-                            () => {
-                                const {id, name} = useParams();
-                                return (
-                                    <div>
-                                        <h1>Hello Mario</h1>
-                                        <h2>ID: {id}</h2>
-                                        {name &&
-                                            <h2>{name}</h2>
-                                        }
-                                    </div>
-                                )
-                            }
+                            () => {}
                         }
                     />

[Survived] ConditionalExpression
src/Router.js:40:42
                                     <div>
                                         <h1>Hello Mario</h1>
                                         <h2>ID: {id}</h2>
-                                        {name &&
-                                            <h2>{name}</h2>
+                                        {true
                                         }
                                     </div>

[Survived] ConditionalExpression
src/Router.js:40:42
                                     <div>
                                         <h1>Hello Mario</h1>
                                         <h2>ID: {id}</h2>
-                                        {name &&
-                                            <h2>{name}</h2>
+                                        {false
                                         }
                                     </div>
