[Survived] BlockStatement
src/api/BlogApi.js:5:24
 
 const baseUrl = 'http://localhost:3900/api/';
 const BlogApi = {
-    getArticles: () => {
-        return axios.get(baseUrl + 'articles')
-    },
+    getArticles: () => {},
     getUrlImageFromArticle: (article) => {
         const image = article.image ?? 'default.jpg'

[Survived] BlockStatement
src/api/BlogApi.js:8:42
     getArticles: () => {
         return axios.get(baseUrl + 'articles')
     },
-    getUrlImageFromArticle: (article) => {
-        const image = article.image ?? 'default.jpg'
-        return `${baseUrl}article/image/${image}`
-    },
+    getUrlImageFromArticle: (article) => {},
     getLastArticles() {
         return axios.get(baseUrl + 'articles/last')

[Survived] LogicalOperator
src/api/BlogApi.js:9:23
         return axios.get(baseUrl + 'articles')
     },
     getUrlImageFromArticle: (article) => {
-        const image = article.image ?? 'default.jpg'
+        const image = article.image && 'default.jpg'
         return `${baseUrl}article/image/${image}`
     },

[Survived] StringLiteral
src/api/BlogApi.js:9:40
         return axios.get(baseUrl + 'articles')
     },
     getUrlImageFromArticle: (article) => {
-        const image = article.image ?? 'default.jpg'
+        const image = article.image ?? ""
         return `${baseUrl}article/image/${image}`
     },

[Survived] BlockStatement
src/api/BlogApi.js:12:23
         const image = article.image ?? 'default.jpg'
         return `${baseUrl}article/image/${image}`
     },
-    getLastArticles() {
-        return axios.get(baseUrl + 'articles/last')
-    },
+    getLastArticles() {},
     getArticlesBySearch(search) {
         return axios.get(baseUrl + 'article/search/' + search)

[Survived] BlockStatement
src/api/BlogApi.js:15:33
     getLastArticles() {
         return axios.get(baseUrl + 'articles/last')
     },
-    getArticlesBySearch(search) {
-        return axios.get(baseUrl + 'article/search/' + search)
-    }
+    getArticlesBySearch(search) {}
 }
 
