[Survived] BlockStatement
src/App.js:5:16
 import React from "react";
 import Router from "./Router";
 
-function App() {
-
-    return (
-        <div className="App">
-            <Router/>
-        </div>
-    );
-}
+function App() {}
 
 export default App;
