[Survived] BlockStatement
src/component/Article/ListArticles.js:13:31
         articles: null,
     }
 
-    async componentDidMount() {
-        const search = this.props.search;
-        if (search){
-            await this.getArticlesBySearch(search)
-            return;
-        }
-        const isHome = this.props.isHome;
-        if (isHome){
-            const response = await BlogApi.getLastArticles();
-            this.setState({
-                articles: response.data.articles
-            });
-            return;
-        }
-        const response = await BlogApi.getArticles();
-        this.setState({
-            articles: response.data.articles
-        });
-    }
+    async componentDidMount() {}
 
     getArticlesBySearch = async (search) => {

[Survived] ConditionalExpression
src/component/Article/ListArticles.js:15:13
 
     async componentDidMount() {
         const search = this.props.search;
-        if (search){
+        if (false){
             await this.getArticlesBySearch(search)
             return;

[Survived] ConditionalExpression
src/component/Article/ListArticles.js:15:13
 
     async componentDidMount() {
         const search = this.props.search;
-        if (search){
+        if (true){
             await this.getArticlesBySearch(search)
             return;

[Survived] BlockStatement
src/component/Article/ListArticles.js:20:20
             return;
         }
         const isHome = this.props.isHome;
-        if (isHome){
-            const response = await BlogApi.getLastArticles();
-            this.setState({
-                articles: response.data.articles
-            });
-            return;
-        }
+        if (isHome){}
         const response = await BlogApi.getArticles();
         this.setState({

[Survived] ConditionalExpression
src/component/Article/ListArticles.js:20:13
             return;
         }
         const isHome = this.props.isHome;
-        if (isHome){
+        if (true){
             const response = await BlogApi.getLastArticles();
             this.setState({

[Survived] BlockStatement
src/component/Article/ListArticles.js:33:45
         });
     }
 
-    getArticlesBySearch = async (search) => {
-        const response = await BlogApi.getArticlesBySearch(search);
-        this.setState({
-            articles: response.data.articles
-        });
-    }
+    getArticlesBySearch = async (search) => {}
 
     render() {

[Survived] ConditionalExpression
src/component/Article/ListArticles.js:41:13
     }
 
     render() {
-        if (this.state.articles === null) {
+        if (false) {
             return (
                 <div>

[Survived] BlockStatement
src/component/Article/ListArticles.js:41:43
     }
 
     render() {
-        if (this.state.articles === null) {
-            return (
-                <div>
-                    <h1>Loading...</h1>
-                </div>
-            )
-        }
+        if (this.state.articles === null) {}
 
         const listArticles = this.state.articles.map((article) => {

[Survived] BlockStatement
src/component/Article/ListArticles.js:49:67
             )
         }
 
-        const listArticles = this.state.articles.map((article) => {
-            return (
-                <article className="article-item" key={article._id}>
-                    <div className="image-wrap">
-                        <img
-                            src={BlogApi.getUrlImageFromArticle(article)}
-                            alt={article.title}/>
-                    </div>
-
-                    <h2>{article.title}</h2>
-                    <span className="date">
-                        <Moment fromNow={true} locale={'es'}>{article.date}</Moment>
-                        </span>
-                    <Link to={`/blog/article/${article._id}`}>Leer más</Link>
-
-                    <div className="clearfix"></div>
-                </article>
-            );
-        })
+        const listArticles = this.state.articles.map((article) => {})
 
         return (

[Survived] BooleanLiteral
src/component/Article/ListArticles.js:60:42
 
                     <h2>{article.title}</h2>
                     <span className="date">
-                        <Moment fromNow={true} locale={'es'}>{article.date}</Moment>
+                        <Moment fromNow={false} locale={'es'}>{article.date}</Moment>
                         </span>
                     <Link to={`/blog/article/${article._id}`}>Leer más</Link>

[Survived] LogicalOperator
src/component/Article/ListArticles.js:71:18
 
         return (
             <div id="articles">
-                {this.state.articles &&
-                    <div>
-                        {listArticles}
-                    </div>
+                {this.state.articles || <div>
+                        {listArticles}
+                    </div>
                 }
             </div>

[Survived] ConditionalExpression
src/component/Article/ListArticles.js:71:18
 
         return (
             <div id="articles">
-                {this.state.articles &&
-                    <div>
-                        {listArticles}
-                    </div>
+                {true
                 }
             </div>
