[Survived] BlockStatement
src/component/Articles.js:14:10
         }
     }
 
-    add(){
-        this.setState({
-            count: (this.state.count + 1)
-        });
-    }
+    add(){}
 
     rest = ()=>{

[Survived] ArithmeticOperator
src/component/Articles.js:16:21
 
     add(){
         this.setState({
-            count: (this.state.count + 1)
+            count: (this.state.count - 1)
         });
     }

[Survived] BlockStatement
src/component/Articles.js:20:16
         });
     }
 
-    rest = ()=>{
-        this.setState({
-            count: (this.state.count - 1)
-        });
-    }
+    rest = ()=>{}
 
     render() {

[Survived] ObjectLiteral
src/component/Articles.js:21:23
     }
 
     rest = ()=>{
-        this.setState({
-            count: (this.state.count - 1)
-        });
+        this.setState({});
     }
 

[Survived] ArithmeticOperator
src/component/Articles.js:22:21
 
     rest = ()=>{
         this.setState({
-            count: (this.state.count - 1)
+            count: (this.state.count + 1)
         });
     }
