[Survived] ArrowFunction
src/component/Header.js:28:48
                             <li>
                                 <NavLink
                                     to="/form"
-                                    className={({ isActive, isPending }) =>
-                                        isPending ? "pending" : isActive ? "active" : ""
+                                    className={() => undefined
                                     }
                                 >

[Survived] StringLiteral
src/component/Header.js:29:76
                                 <NavLink
                                     to="/form"
                                     className={({ isActive, isPending }) =>
-                                        isPending ? "pending" : isActive ? "active" : ""
+                                        isPending ? "pending" : isActive ? "" : ""
                                     }
                                 >

[Survived] StringLiteral
src/component/Header.js:29:87
                                 <NavLink
                                     to="/form"
                                     className={({ isActive, isPending }) =>
-                                        isPending ? "pending" : isActive ? "active" : ""
+                                        isPending ? "pending" : isActive ? "active" : "Stryker was here!"
                                     }
                                 >
