[Survived] BlockStatement
src/component/Footer.js:3:22
 import React from "react";
 
-const Footer = () => {
-    return (
-        <footer id="footer">
-            <div className="center">
-                <p>
-                    &copy; Learning React
-                </p>
-            </div>
-        </footer>
-    );
-}
+const Footer = () => {}
 
 export default Footer;
