[Survived] BlockStatement
src/component/MyComponent/MyComponent.js:21:65
                 <h2>Calories {recipe.calories}</h2>
                 <ol>
                     {
-                        recipe.ingredients.map((ingredient, i)=>{
-                            return (
-                                <li key={i}>
-                                    {ingredient}
-                                </li>
-                            );
-                        })
+                        recipe.ingredients.map((ingredient, i)=>{})
                     }
                 </ol>
