[Survived] BlockStatement
src/component/Sidebar.js:4:14
 import React from "react";
 
 class Sidebar extends React.Component {
-    render() {
-        return (
-            <aside id="sidebar">
-                {this.props.blog &&
-                    <div id="nav-blog" className="sidebar-item">
-                    <h3>Puedes hacer esto</h3>
-                    <a href="#" className="btn btn-success">Crear artículo</a>
-                </div>
-                }
-
-                <div id="search" className="sidebar-item">
-                    <h3>Buscador</h3>
-                    <p>Encuentra el artículo que buscas</p>
-                    <form>
-                        <input type="text" name="search"/>
-                        <input type="submit" name="submit" value="Buscar" className="btn"/>
-                    </form>
-                </div>
-            </aside>
-        );
-    }
+    render() {}
 }
 

[Survived] LogicalOperator
src/component/Sidebar.js:7:18
     render() {
         return (
             <aside id="sidebar">
-                {this.props.blog &&
-                    <div id="nav-blog" className="sidebar-item">
-                    <h3>Puedes hacer esto</h3>
-                    <a href="#" className="btn btn-success">Crear artículo</a>
-                </div>
+                {this.props.blog || <div id="nav-blog" className="sidebar-item">
+                    <h3>Puedes hacer esto</h3>
+                    <a href="#" className="btn btn-success">Crear artículo</a>
+                </div>
                 }
 

[Survived] ConditionalExpression
src/component/Sidebar.js:7:18
     render() {
         return (
             <aside id="sidebar">
-                {this.props.blog &&
-                    <div id="nav-blog" className="sidebar-item">
-                    <h3>Puedes hacer esto</h3>
-                    <a href="#" className="btn btn-success">Crear artículo</a>
-                </div>
+                {true
                 }
 
