[Survived] BlockStatement
src/component/Slider.js:4:14
 import React from "react";
 
 class Slider extends React.Component {
-    render() {
-        const size = this.props.size ?? 'big';
-        return (
-            <div id="slider" className={'slider-'+size}>
-                <h1>{this.props.title}</h1>
-                {this.props.button &&
-                    <a href="#" className="btn-white">{this.props.button}</a>
-                }
-            </div>
-        );
-    }
+    render() {}
 }
 

[Survived] LogicalOperator
src/component/Slider.js:5:22
 
 class Slider extends React.Component {
     render() {
-        const size = this.props.size ?? 'big';
+        const size = this.props.size && 'big';
         return (
             <div id="slider" className={'slider-'+size}>

[Survived] ConditionalExpression
src/component/Slider.js:9:18
         return (
             <div id="slider" className={'slider-'+size}>
                 <h1>{this.props.title}</h1>
-                {this.props.button &&
-                    <a href="#" className="btn-white">{this.props.button}</a>
+                {true
                 }
             </div>

[Survived] LogicalOperator
src/component/Slider.js:9:18
         return (
             <div id="slider" className={'slider-'+size}>
                 <h1>{this.props.title}</h1>
-                {this.props.button &&
-                    <a href="#" className="btn-white">{this.props.button}</a>
+                {this.props.button || <a href="#" className="btn-white">{this.props.button}</a>
                 }
             </div>
