[Survived] BlockStatement
src/page/Blog.js:8:14
 import ListArticles from "../component/Article/ListArticles";
 
 class Blog extends React.Component {
-    render() {
-        return (
-            <div id="blog">
-                <Slider
-                    title={"Last Articles"}
-                    size={'small'}
-                />
-                <div className="center">
-                    <section id="content">
-                        <ListArticles/>
-                    </section>
-                    <Sidebar
-                        blog={true}
-                    />
-
-                    <div className="clearfix"></div>
-                </div>
-            </div>
-        );
-    }
+    render() {}
 }
 

[Survived] BooleanLiteral
src/page/Blog.js:20:31
                         <ListArticles/>
                     </section>
                     <Sidebar
-                        blog={true}
+                        blog={false}
                     />
 
