[Survived] BlockStatement
src/page/Form.js:16:29
         user: null
     };
 
-    handleFormSubmit = (e)=>{
-        e.preventDefault();
-
-        const isMale = this.refSex.current.checked;
-        let sex = 'female';
-        if (isMale){
-            sex = 'male';
-        }
-
-        const user = {
-            name: this.refName.current.value,
-            surname: this.refSurname.current.value,
-            bio: this.refBio.current.value,
-            sex: sex,
-        }
-
-        this.setState({
-            user: user
-        });
-    }
+    handleFormSubmit = (e)=>{}
     render() {
         return (

[Survived] BlockStatement
src/page/Form.js:21:20
 
         const isMale = this.refSex.current.checked;
         let sex = 'female';
-        if (isMale){
-            sex = 'male';
-        }
+        if (isMale){}
 
         const user = {

[Survived] ConditionalExpression
src/page/Form.js:21:13
 
         const isMale = this.refSex.current.checked;
         let sex = 'female';
-        if (isMale){
+        if (true){
             sex = 'male';
         }

[Survived] StringLiteral
src/page/Form.js:40:28
         return (
             <div id="form">
                 <Slider
-                    title={"Create new entry"}
+                    title={""}
                     size={'small'}
                 />

[Survived] ConditionalExpression
src/page/Form.js:47:26
                     <section id="content">
                         <h1 className="subheader">Formulario</h1>
 
-                        {this.state.user &&
-                            <div>
-                                {JSON.stringify(this.state.user)}
-                            </div>
+                        {false
                         }
 

[Survived] ConditionalExpression
src/page/Form.js:47:26
                     <section id="content">
                         <h1 className="subheader">Formulario</h1>
 
-                        {this.state.user &&
-                            <div>
-                                {JSON.stringify(this.state.user)}
-                            </div>
+                        {true
                         }
 
