[Survived] BlockStatement
src/page/Error.js:3:21
 import React from "react";
 
-const Error = () => {
-    return(
-        <section>
-            <h2>Page not found</h2>
-            <p>The selected page wat not found</p>
-        </section>
-    );
-}
+const Error = () => {}
 
 export default Error;
