[Survived] BlockStatement
src/page/Home.js:6:14
 import Sidebar from "../component/Sidebar";
 import ListArticles from "../component/Article/ListArticles";
 class Home extends React.Component {
-    render() {
-        return (
-            <div id="home">
-                <Slider
-                    title={"Welcome to my blog made with React"}
-                    button={'Go Blog'}
-                />
-                <div className="center">
-                    <section id="content">
-                        <h1>Last Articles</h1>
-                        <ListArticles
-                            isHome={true}
-                        />
-                    </section>
-                    <Sidebar/>
-
-                    <div className="clearfix"></div>
-                </div>
-            </div>
-        );
-    }
+    render() {}
 }
 

[Survived] BooleanLiteral
src/page/Home.js:17:37
                     <section id="content">
                         <h1>Last Articles</h1>
                         <ListArticles
-                            isHome={true}
+                            isHome={false}
                         />
                     </section>
