[Survived] ArrayDeclaration
src/page/Movies/Movies.js:6:17
 
 class Movies extends Component {
     state = {
-        movies: [
-            {
-                title: 'Batman Begins',
-                image: 'https://pics.filmaffinity.com/Matrix-155050517-large.jpg'
-            },
-            {
-                title: 'Matrix',
-                image: 'https://pics.filmaffinity.com/Matrix-155050517-large.jpg'
-            },
-            {
-                title: 'The Godfather',
-                image: 'https://m.media-amazon.com/images/M/MV5BM2MyNjYxNmUtYTAwNi00MTYxLWJmNWYtYzZlODY3ZTk3OTFlXkEyXkFqcGdeQXVyNzkwMjQ5NzM@._V1_.jpg'
-            }
-        ],
+        movies: [],
         favourite: null
     }

[Survived] StringLiteral
src/page/Movies/Movies.js:8:24
     state = {
         movies: [
             {
-                title: 'Batman Begins',
+                title: "",
                 image: 'https://pics.filmaffinity.com/Matrix-155050517-large.jpg'
             },

[Survived] StringLiteral
src/page/Movies/Movies.js:13:24
             },
             {
                 title: 'Matrix',
-                image: 'https://pics.filmaffinity.com/Matrix-155050517-large.jpg'
+                image: ""
             },
             {

[Survived] ObjectLiteral
src/page/Movies/Movies.js:15:13
                 title: 'Matrix',
                 image: 'https://pics.filmaffinity.com/Matrix-155050517-large.jpg'
             },
-            {
-                title: 'The Godfather',
-                image: 'https://m.media-amazon.com/images/M/MV5BM2MyNjYxNmUtYTAwNi00MTYxLWJmNWYtYzZlODY3ZTk3OTFlXkEyXkFqcGdeQXVyNzkwMjQ5NzM@._V1_.jpg'
-            }
+            {}
         ],
         favourite: null

[Survived] StringLiteral
src/page/Movies/Movies.js:16:24
                 image: 'https://pics.filmaffinity.com/Matrix-155050517-large.jpg'
             },
             {
-                title: 'The Godfather',
+                title: "",
                 image: 'https://m.media-amazon.com/images/M/MV5BM2MyNjYxNmUtYTAwNi00MTYxLWJmNWYtYzZlODY3ZTk3OTFlXkEyXkFqcGdeQXVyNzkwMjQ5NzM@._V1_.jpg'
             }

[Survived] BlockStatement
src/page/Movies/Movies.js:23:32
         favourite: null
     }
 
-    markFavourite = (movie) => {
-        this.setState({
-            favourite: movie
-        });
-    }
+    markFavourite = (movie) => {}
 
     render() {

[Survived] ConditionalExpression
src/page/Movies/Movies.js:33:12
         let movieFavourite = (
             <p>There isn't favourite movie</p>
         );
-        if(this.state.favourite){
+        if(true){
             movieFavourite = (
                 <p>

[Survived] ConditionalExpression
src/page/Movies/Movies.js:33:12
         let movieFavourite = (
             <p>There isn't favourite movie</p>
         );
-        if(this.state.favourite){
+        if(false){
             movieFavourite = (
                 <p>

[Survived] StringLiteral
src/page/Movies/Movies.js:43:29
         }
 
         return (
-            <div className={'movies'}>
+            <div className={""}>
                 <h2>Movies</h2>
 

[Survived] BlockStatement
src/page/Movies/Movies.js:49:57
                 {movieFavourite}
 
                 {
-                    this.state.movies.map((movie, i) => {
-                        return (
-                            <Movie
-                                key={i}
-                                movie={movie}
-                                markFavourite={this.markFavourite}
-                            />
-                        );
-                    })
+                    this.state.movies.map((movie, i) => {})
                 }
             </div>
