[Survived] BlockStatement
src/page/Search.js:8:22
 import Sidebar from "../component/Sidebar";
 import {useParams} from "react-router-dom";
 
-const Search = () => {
-
-    const {search} = useParams();
-
-    return (
-        <div id="blog">
-            <Slider
-                title={"Search: " + search}
-                size={'small'}
-            />
-            <div className="center">
-                <section id="content">
-                    <ListArticles
-                        search={search}
-                    />
-                </section>
-                <Sidebar
-                    blog={true}
-                />
-
-                <div className="clearfix"></div>
-            </div>
-        </div>
-    );
-}
+const Search = () => {}
 
 export default Search;

[Survived] StringLiteral
src/page/Search.js:15:24
     return (
         <div id="blog">
             <Slider
-                title={"Search: " + search}
+                title={"" + search}
                 size={'small'}
             />

[Survived] StringLiteral
src/page/Search.js:16:23
         <div id="blog">
             <Slider
                 title={"Search: " + search}
-                size={'small'}
+                size={""}
             />
             <div className="center">
