[Killed] BlockStatement
src/service/IsNeedApplyDiscount.js:3:41
 
 
-const IsNeedApplyDiscount = (precio) => {
-    if(precio >= 500){
-        return true;
-    }
-    return false;
-}
+const IsNeedApplyDiscount = (precio) => {}
 
 export default IsNeedApplyDiscount;
killedBy: Testing IsNeedApplyDiscount should returns true if price is greater than 500
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
src/service/IsNeedApplyDiscount.js:4:8
 
 
 const IsNeedApplyDiscount = (precio) => {
-    if(precio >= 500){
+    if(true){
         return true;
     }
killedBy: Testing IsNeedApplyDiscount should returns false if price is less than 500
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/service/IsNeedApplyDiscount.js:4:8
 
 
 const IsNeedApplyDiscount = (precio) => {
-    if(precio >= 500){
+    if(precio > 500){
         return true;
     }
killedBy: Testing IsNeedApplyDiscount should returns true if price is greater than 500
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/service/IsNeedApplyDiscount.js:5:16
 
 const IsNeedApplyDiscount = (precio) => {
     if(precio >= 500){
-        return true;
+        return false;
     }
     return false;
killedBy: Testing IsNeedApplyDiscount should returns true if price is greater than 500
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
